/***********************************************************************************************************************
* 文件名称: hal_epd.c
* 文件描述: 墨水屏幕相关封装函数
* 维护人员: bo.liangmin
* 版本信息: 20230814--代码创建
***********************************************************************************************************************/



/***********************************************************************************************************************
* include
***********************************************************************************************************************/
#include "hal_epd.h"
#include "hal_spi.h"
#include "hal_rtc.h"
#include "hal_board.h"
#include "nrf_gpio.h"



/***********************************************************************************************************************
* define
***********************************************************************************************************************/
uint8_t recv_data = 0;



/***********************************************************************************
* 函数名称: void HAL_EPD_DelayMs(uint16_t ms)
* 函数说明: 延时函数
* 输入参数: 无
* 输出参数: 无
* 返回数值: 无
***********************************************************************************/
void HAL_EPD_DelayMs(uint16_t ms)
{
    uint32_t epd_ticks = HAL_RTC_GetSysTicks();

    while(1)
    {
        if(HAL_RTC_GetSysTicks() - epd_ticks >= ms)
        {
            break;
        }
    }
}

/***********************************************************************************
* 函数名称: void HAL_EPD_ResetOn(void)
* 函数说明: reset on
* 输入参数: 无
* 输出参数: 无
* 返回数值: 无
***********************************************************************************/
void HAL_EPD_ResetOn(void)
{
    nrf_gpio_pin_clear(EPD_RESET_PIN);
}

/***********************************************************************************
* 函数名称: void HAL_EPD_ResetOff(void)
* 函数说明: reset off
* 输入参数: 无
* 输出参数: 无
* 返回数值: 无
***********************************************************************************/
void HAL_EPD_ResetOff(void)
{
    nrf_gpio_pin_set(EPD_RESET_PIN);
}

/***********************************************************************************
* 函数名称: static void HAL_EPD_ChipSelect(void)
* 函数说明: cs select
* 输入参数: 无
* 输出参数: 无
* 返回数值: 无
***********************************************************************************/
static void HAL_EPD_ChipSelect(void)
{
    nrf_gpio_pin_clear(EPD_SPI_CS_PIN);
}

/***********************************************************************************
* 函数名称: static void HAL_EPD_ChipRelease(void)
* 函数说明: cs release
* 输入参数: 无
* 输出参数: 无
* 返回数值: 无
***********************************************************************************/
static void HAL_EPD_ChipRelease(void)
{
    nrf_gpio_pin_set(EPD_SPI_CS_PIN);
}

/***********************************************************************************
* 函数名称: static void HAL_EPD_DCCommand(void)
* 函数说明: 写命令
* 输入参数: 无
* 输出参数: 无
* 返回数值: 无
***********************************************************************************/
static void HAL_EPD_DCCommand(void)
{
    nrf_gpio_pin_clear(EPD_DC_PIN);
}

/***********************************************************************************
* 函数名称: static void HAL_EPD_DCData(void)
* 函数说明: 写数据
* 输入参数: 无
* 输出参数: 无
* 返回数值: 无
***********************************************************************************/
static void HAL_EPD_DCData(void)
{
    nrf_gpio_pin_set(EPD_DC_PIN);
}

/***********************************************************************************
* 函数名称: uint8_t HAL_EPD_BusyPinReady(void)
* 函数说明: 获取BUSY管脚状态，1--ready,0--not ready
* 输入参数: 无
* 输出参数: 无
* 返回数值: 无
***********************************************************************************/
uint8_t HAL_EPD_BusyPinReady(void)
{
    uint32_t busy_tick = HAL_RTC_GetSysTicks();
    while(1)
    {
        if(0 == nrf_gpio_pin_read(EPD_BUSY_PIN))
        {
            return 1;
        }
        else
        {
            if(HAL_RTC_GetSysTicks() - busy_tick >= 100)
            {
                return 0;
            }
        }
    }
}

/***********************************************************************************
* 函数名称: void HAL_EPD_WriteCommand(uint8_t command)
* 函数说明: 向EPD写命令
* 输入参数: 无
* 输出参数: 无
* 返回数值: 无
***********************************************************************************/
void HAL_EPD_WriteCommand(uint8_t command)
{
    HAL_EPD_ChipSelect();
    HAL_EPD_DCCommand();
    HAL_SPI_Trans(&command, &recv_data, 1);
    HAL_EPD_ChipRelease();
}

/***********************************************************************************
* 函数名称: void HAL_EPD_WriteData(uint8_t data)
* 函数说明: 向EPD写数据
* 输入参数: 无
* 输出参数: 无
* 返回数值: 无
***********************************************************************************/
void HAL_EPD_WriteData(uint8_t data)
{
    HAL_EPD_ChipSelect();
    HAL_EPD_DCData();
    HAL_SPI_Trans(&data, &recv_data, 1);
    HAL_EPD_ChipRelease();
}



/***********************************************************************************************************************
* end
***********************************************************************************************************************/


