/************************************************************************************************************************************************
* 文件名称：hal_rtc.c
* 文件描述：RTC相关驱动函数
* 文件作者：bo.liangmin
* 版本信息：20230629--文件创建
************************************************************************************************************************************************/



/************************************************************************************************************************************************
* include
************************************************************************************************************************************************/
#include "hal_rtc.h"


/************************************************************************************************************************************************
* define
************************************************************************************************************************************************/
static uint32_t systicks = 0;


static void HAL_RTC_ConfigLFCLK(void)
{
    NRF_CLOCK->LFCLKSRC             = (CLOCK_LFCLKSRC_SRC_Xtal << CLOCK_LFCLKSRC_SRC_Pos);
    NRF_CLOCK->EVENTS_LFCLKSTARTED  = 0;
    NRF_CLOCK->TASKS_LFCLKSTART     = 1;                   //启动低速时钟任务
    while (NRF_CLOCK->EVENTS_LFCLKSTARTED == 0)
    {
        //等待低速时钟配置
    }
    NRF_CLOCK->EVENTS_LFCLKSTARTED = 0;
    
    NRF_RTC0->TASKS_START = 1;
}

void HAL_RTC_IRQHandler()
{
    if ((NRF_RTC0->EVENTS_TICK != 0) && ((NRF_RTC0->INTENSET & RTC_INTENSET_TICK_Msk) != 0))     //事件使能，同时中断使能
    {
        NRF_RTC0->EVENTS_TICK = 0;
        systicks++;
    }
}

void HAL_RTC_Init(void)
{
    HAL_RTC_ConfigLFCLK();
    
    NVIC_EnableIRQ(RTC0_IRQn);                                      // 使能RTC中断
    NRF_RTC0->PRESCALER = COUNTER_PRESCALER;                        // 设置预分频值，需要知道计算器的运行频率

    // Enable TICK event and TICK interrupt:
    NRF_RTC0->EVTENSET  = RTC_EVTENSET_TICK_Msk;
    NRF_RTC0->INTENSET  = RTC_INTENSET_TICK_Msk;
}

uint32_t HAL_RTC_GetSysTicks(void)
{
    return systicks;
}







/************************************************************************************************************************************************
* end
************************************************************************************************************************************************/



